{
    "id": "LazyCowboy.DestructionShader",
    "name": "Destruction Shader",
    "version": "0.0.1",
    "target_game_version": "v1.11",
    "authors": "TheLazyCowboy1",
    "description": "Makes all rooms in the game look more degraded, using a shader that alters the level texture whenever the screen changes. Except poles. I hate poles. They make everything so unreasonably frustrating.<LINE><LINE>Use Cases:<LINE>Makes a slight difference if you think that Rain World is too pristine for some bizarre reason. Maybe turn this on when playing as Rivulet and Saint?<LINE>Change the strength of the effect in the config/remix menu for this mod.<LINE><LINE>Performance:<LINE>The performance is comparable to the snow shader for MSC. I think it should be around 10ms in theory, but it's also supposed to be async, so I haven't properly measured yet. Regardless, I can barely notice the potential frame (singular) drop on my low-to-mid-end device, so I'd say the performance is fine.<LINE><LINE>Inspiration:<LINE>I felt like Saint's campaign had a noticeable disparity between the structure of Saint's custom regions and the unchanged vanilla regions. This potentially helps slightly. I also more specifically planned to use it to smooth out region transitions between community-made regions for a mod I'm making.<LINE><LINE>Bugs:<LINE>If I knew any, they wouldn't be here. ...okay, maybe that's not true, but there's no currently know bugs, so let me know what you find if you decide to use this mod for some reason!<LINE><LINE>Poles:<LINE>Special shoutout to poles! Those thin little sticks would get turned basically invisible by this shader, so I had to map out all the poles in the room and tell the shader not to totally wreck pixels where poles are. Thank you poles; I hate you.<LINE>Can you imagine invisible poles? And you thought they couldn't get any worse in this game...",
    "requirements": [ ],
    "requirements_names": [ ],
    "tags": [ "Cosmetics" ],
    "checksum_override_version": false
}